{"title": "Sixth week of coding phase, GSoC'18", "date": "2018-06-24", "tags": ["GSoC", "Falkon", "KDE"], "archived": "y", "description": "A lot or progress is made in this week, including Menu API, Settings API and documentation of the APIs developed in previous weeks.", "slug": "sixth-week-of-coding-phase-gsoc-18-2018-06-24", "content": "<p>Woo.. this is the 6th weekly post - the midway of GSoC (12 weeks). In this 6th week, the following work is done:</p>\n\n<ul>\n<li><p>Documentation: of the APIs developed in the previous week.</p></li>\n<li><p>Menus API: The API exposing WebView contextmenu.</p></li>\n<li><p>Settings API: The API to store settings in form of Key-Value pair for plugins</p></li>\n</ul>\n\n<h2>Menus API</h2>\n\n<p>The Menus API enables the QML Plugin to add an action, separator or menu to the WebView context menu. This API is not similar to the WebExtensions Menus API but is rather Falkonish!\n<center>\n<img src=\"menu_on_input.png\" alt=\"Context menu on image\" />\n</center></p>\n\n<h2>Settings API</h2>\n\n<p>The Settings API enables the QML Plugin to store settings as key-value pairs and uses QSettings to store the data. Developing this API was interesting because it led to a bug-fix (bug was in my previous work) and enabling creating child items in QmlPluginInterface.\n<center>\n<img src=\"plugins_settings_window.png\" alt=\"Plugin's settings window\" />\n</center></p>\n\n<p><br/>\nI have also created a video to demonstrate the used of Menus and Settings API in HelloQML plugin. The source of HelloQML plugin can be viewed <a href=\"https://cgit.kde.org/falkon.git/tree/src/scripts/helloqml?h=anmolgautam\">here</a>.\n<br/>\n<center></p>\n\n<iframe width=\"100%\" height=\"350\" src=\"https://www.youtube.com/embed/nXuJfOGo9D4\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen></iframe>\n\n<p></center>\n<br/>\nI am very thankful to my mentor David Rosca for suggesting and reviewing the design of the APIs.</p>\n\n<p>Happy Monsoon :-)</p>\n"}